#Задача 26: 
print ('введите чисто a')
a = (int input())
print ('введите чисто b')
b = (int input())
c = 0
if a <= -1 or b <= -1:
print ('введите целое не отриц число')
c = (a**b)
print(c)

#Задача 28:
def sum_numbers(a,b)
print ('введите чисто a')
a = (int input())
print ('введите чисто b')
b = (int input())
summa = 0
summa = (a + b)
if a > 0 or a < 0  and b > 0 or b < 0:
return summa

