
# №2. сумма цифр трехзначного числа
print ('введите трехзначное число')
a = int (input())
print (a[0], a[1], a[2])
sum = 0
sum =(a[0] + a[1] + a[2] )
print (sum)

# №3. Петя, Сережа, Катя журавлики. a - журавлики пети, c -катины 
a = int, c = int, s = int
sum1 = (a + a)
c = (sum1 *2)
a = (s - c)
print(a, a, c)

# №6 счастливый билет
print ('введите номер билета')
a = int (input())
print (a[0], a[1], a[2], a[3], a[4], a[5])
sum1 = 0
sum2 = 0
sum1 =(a[0] + a[1] + a[2] )
print (sum)
sum2 =(a[3] + a[4] + a[5] )
if sum1==sum2
print ('билет счастливый')
else 
('билет не счастливый')

# № 8 шоколадка, c = площадь шоколадки,
# числа должны быть четными чтобы условие выполнялось
k = int, n = int, m = int, c = int
c = n * m 
if (k/2 == %0) and (c/2 == %0) #остаток от деления на 2 ноль
print ('true')
else
print ('false')